emacs/dot-emacs.d/init.org
;; init.org -*- lexical-binding: t -*-
#+title: Literate configuration for Emacs 30.1
#+author: Roie R. Black
#+date: 2025-08-22
#+SETUPFILE: ./theme/theme-readtheorg-local.setup
#+EXPORT_FILE_NAME: index

* Literate Programming

/Emacs org-mode/ supports a version of /Literate Programming/ pioneered by Professor Donald Knuth at Stanford in 1981. This scheme lets you create a document meant for human readers where you /explain/ how your code is designed. In that explanation, you can introduce blocks of code where the actual code you are developing actually live. These blocks are obviously designed to be short snippets, not the full code which is really meant to be processed by a computer program anyway. Multiple blocks can be stitched together using a tool Knuth

called /Tangle/. In /Org-mode/ we mark each code clock and use a feature of /Org-mode/ (actually, /org-bable/) to extract the code and save it in files with proper names.

This document uses /Emacs org-mode/ to build the *init.el* file, and a number of module files as well. /Emacs/ will be used to extract the actual *init.el* file and all defined modules. This
can be done using simple commands in the editor, or using a *Makefile* included
in this project.

Here is the start of the *init.el* file:

#+begin_src elisp :tangle init.el
;; -*- lexical-binding: t -*-
;; elisp.org - copyright 2025 by Roie Black
;;-----------------------------------------
#+end_src

* Locating Component Files

Rather than build one gigantic file, The configuration file will be broken up into separate parts, each focusing on one aspect of the configuration. This will enable testing of one major component at a time. The component files will be stored in a *modules* subdirectory. We need to tell /Emacs/ about this:

#+begin_src elisp :tangle init.el
;; Add module directory to load_path
(add-to-list 'load-path "/Users/rblack/.emacs.d/modules")
(add-to-list 'load-path ".")
#+end_src

Adding the current directory to the list is needed for exporting this file to /HTML/ when we generate a web page from this file.

* Basic Functions

/Emacs/ does a few things in its default configuration that I want to modify.
These modifications will be placed in our first module:


#+begin_src elisp :tangle modules/rrb-basic.el
;; -*- lexical-binding: t -*-
(setq
    make-backup-files nil   ;; no backup files
    auto-save-default nil)  ;; do not create auto save files
(display-time-mode 1)       ;; Display time in mode line / tab bar
(column-number-mode 1)      ;; Show column number on mode line
;; Tabs to spaces
(setq-default indent-tabs-mode nil
	            tab-width 2)
(global-visual-line-mode 1) ;; wrap long lines in all buffers

;; Delete trailing whitespace before saving buffers
(add-hook 'before-save-hook 'delete-trailing-whitespace)

;; Move customization settings out of init.el
(setq custom-file (expand-file-name "custom.el" user-emacs-directory))
(when (file-exists-p custom-file)
  (load custom-file t))
#+end_src

At the end of each module, we need to tell /Emacs/ what module this file provides:

#+begin_src elisp :tangle modules/rrb-basic.el
(provide 'rrb-basic)
#+end_src

To hook this module into the *init.el* file, we use the *require* function:

#+begin_src elisp :tangle init.el
;; hook modules into this file
(require 'rrb-basic)
#+end_src

Now, when the (init.el* file is loaded, the /required/ module code files will also be processed.

This completes our first module. We will use this same pattern will be used as we create more modules in this file.

* Simplifying Startup Display

When /Emacs/ first starts in graphics mode it normally displays a splash screen identifying the program and displaying a few links to interesting things you can explore. After the first few times you use the program, this becomes a distraction. We can do some basic set up to stop this.

#+begin_src elisp :tangle modules/rrb-ui.el
;; -*- lexical-binding: t -*-
;; do not display the splash screen
(when (display-graphic-p)
  (tool-bar-mode 0)
  (scroll-bar-mode 0))
  ;; (menu-bar-mode 0) ; disabled here, not a problem on Mac
(setq inhibit-startup-screen t)
#+end_src

