docs/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-09-02 Tue 19:32 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Literate configuration for Emacs 30.1</title>
<meta name="author" content="Roie R. Black" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="theme/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="theme/readtheorg_theme/css/readtheorg.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">Literate configuration for Emacs 30.1</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org95ded0d">1. Literate Programming</a></li>
<li><a href="#org37d3459">2. Locating Component Files</a></li>
<li><a href="#org3d87f41">3. Basic Functions</a></li>
<li><a href="#orgbabfc41">4. Simplifying Startup Display</a></li>
<li><a href="#orgcc70eed">5. Create a Basic Theme</a></li>
<li><a href="#org7cdb8bb">6. Package Management</a></li>
<li><a href="#orgcae24ba">7. Window management</a></li>
<li><a href="#orgd304725">8. Learning Key Mappings</a></li>
<li><a href="#orgdf1e03e">9. Spell Checking</a></li>
<li><a href="#org5d720d7">10. Managing Git Projects</a></li>
<li><a href="#org7d933cb">11. Configure Org Mode</a>
<ul>
<li><a href="#org6320296">11.1. Adding To-Do lists</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
;; init.org -<b>- lexical-binding: t -</b>-
</p>
<div id="outline-container-org95ded0d" class="outline-2">
<h2 id="org95ded0d"><span class="section-number-2">1.</span> Literate Programming</h2>
<div class="outline-text-2" id="text-1">
<p>
<i>Emacs org-mode</i> supports a version of <i>Literate Programming</i> pioneered by Professor Donald Knuth at Stanford in 1981. This scheme lets you create a document meant for human readers where you <i>explain</i> how your code is designed. In that explanation, you can introduce blocks of code where the actual code you are developing actually live. These blocks are obviously designed to be short snippets, not the full code which is really meant to be processed by a computer program anyway. Multiple blocks can be stitched together using a tool Knuth
</p>

<p>
called <i>Tangle</i>. In <i>Org-mode</i> we mark each code clock and use a feature of <i>Org-mode</i> (actually, <i>org-bable</i>) to extract the code and save it in files with proper names.
</p>

<p>
This document uses <i>Emacs org-mode</i> to build the <b>init.el</b> file, and a number of module files as well. <i>Emacs</i> will be used to extract the actual <b>init.el</b> file and all defined modules. This
can be done using simple commands in the editor, or using a <b>Makefile</b> included
in this project.
</p>

<p>
Here is the start of the <b>init.el</b> file:
</p>

<div class="org-src-container">
<pre class="src src-elisp"><span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">-*- lexical-binding: t -*-</span>
<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">elisp.org - copyright 2025 by Roie Black</span>
<span style="font-weight: bold; font-style: italic;">;;</span><span style="font-weight: bold; font-style: italic;">-----------------------------------------</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org37d3459" class="outline-2">
<h2 id="org37d3459"><span class="section-number-2">2.</span> Locating Component Files</h2>
<div class="outline-text-2" id="text-2">
<p>
Rather than build one gigantic file, The configuration file will be broken up into separate parts, each focusing on one aspect of the configuration. This will enable testing of one major component at a time. The component files will be stored in a <b>modules</b> subdirectory. We need to tell <i>Emacs</i> about this:
</p>

<div class="org-src-container">
<pre class="src src-elisp"><span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Add module directory to load_path</span>
(add-to-list 'load-path <span style="font-style: italic;">"/Users/rblack/.emacs.d/modules"</span>)
(add-to-list 'load-path <span style="font-style: italic;">"."</span>)
</pre>
</div>

<p>
Adding the current directory to the list is needed for exporting this file to <i>HTML</i> when we generate a web page from this file.
</p>
</div>
</div>
<div id="outline-container-org3d87f41" class="outline-2">
<h2 id="org3d87f41"><span class="section-number-2">3.</span> Basic Functions</h2>
<div class="outline-text-2" id="text-3">
<p>
<i>Emacs</i> does a few things in its default configuration that I want to modify.
These modifications will be placed in our first module:
</p>


<div class="org-src-container">
<pre class="src src-elisp"><span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">-*- lexical-binding: t -*-</span>
(<span style="font-weight: bold;">setq</span>
    make-backup-files nil   <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">no backup files</span>
    auto-save-default nil)  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">do not create auto save files</span>
(display-time-mode 1)       <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Display time in mode line / tab bar</span>
(column-number-mode 1)      <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Show column number on mode line</span>
<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Tabs to spaces</span>
(<span style="font-weight: bold;">setq-default</span> indent-tabs-mode nil
                    tab-width 2)
(global-visual-line-mode 1) <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">wrap long lines in all buffers</span>

<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Delete trailing whitespace before saving buffers</span>
(add-hook 'before-save-hook 'delete-trailing-whitespace)

<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Move customization settings out of init.el</span>
(<span style="font-weight: bold;">setq</span> custom-file (expand-file-name <span style="font-style: italic;">"custom.el"</span> user-emacs-directory))
(<span style="font-weight: bold;">when</span> (file-exists-p custom-file)
  (load custom-file t))
</pre>
</div>

<p>
At the end of each module, we need to tell <i>Emacs</i> what module this file provides:
</p>

<div class="org-src-container">
<pre class="src src-elisp">(<span style="font-weight: bold;">provide</span> '<span style="font-weight: bold; text-decoration: underline;">rrb-basic</span>)
</pre>
</div>

<p>
To hook this module into the <b>init.el</b> file, we use the <b>require</b> function:
</p>

<div class="org-src-container">
<pre class="src src-elisp"><span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">hook modules into this file</span>
(<span style="font-weight: bold;">require</span> '<span style="font-weight: bold; text-decoration: underline;">rrb-basic</span>)
</pre>
</div>

<p>
Now, when the (init.el* file is loaded, the <i>required</i> module code files will also be processed.
</p>

<p>
This completes our first module. We will use this same pattern will be used as we create more modules in this file.
</p>
</div>
</div>
<div id="outline-container-orgbabfc41" class="outline-2">
<h2 id="orgbabfc41"><span class="section-number-2">4.</span> Simplifying Startup Display</h2>
<div class="outline-text-2" id="text-4">
<p>
When <i>Emacs</i> first starts in graphics mode it normally displays a splash screen identifying the program and displaying a few links to interesting things you can explore. After the first few times you use the program, this becomes a distraction. We can do some basic set up to stop this.
</p>

<div class="org-src-container">
<pre class="src src-elisp"><span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">-*- lexical-binding: t -*-</span>
<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">do not display the splash screen</span>
(<span style="font-weight: bold;">when</span> (display-graphic-p)
  (tool-bar-mode 0)
  (scroll-bar-mode 0))
  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">(menu-bar-mode 0) ; disabled here, not a problem on Mac</span>
(<span style="font-weight: bold;">setq</span> inhibit-startup-screen t)
</pre>
</div>
</div>
</div>
