emacs/dot-emacs.d/init.org
* Create a Basic Theme

There are many themes we could use. However, here is a basic block that sets colors in an easy to tweak block of code

#+begin_src elisp :tangle modules/rrb-ui.el
;; load an example dark theme
(load-theme 'wombat)
(with-eval-after-load 'wombat-theme
  (set-face-background 'default "#111")
  (set-face-background 'cursor "#c96")
  (set-face-foreground 'font-lock-comment-face "#fc0")
  (set-face-background 'isearch "#ff0")
  (set-face-foreground 'isearch "#000")
  (set-face-background 'lazy-highlight "#990")
  (set-face-foreground 'lazy-highlight "#000"))
#+end_src

At this point, we need to indicate that this module provides *rrb_ui* so theloader will not complain:


#+begin_src elisp :tangle modules/rrb-ui.el
(provide 'rrb-ui)
#+end_src

Hook this module into the *init.el* file

#+begin_src elisp :tangle init.el
;; hook modules into this file
(require 'rrb-ui)
#+end_src

* Package Management

Before we add packages to the setup, we need to set up the package management
system:

#+begin_src elisp :tangle modules/rrb-package.el
;; -*- lexical-binding: t -*-
;;======================================================================
;; package management
;;
;; Initialize package sources
(require 'package)

(setq package-archives '(("melpa" . "https://melpa.org/packages/")
                         ("org" . "https://orgmode.org/elpa/")
                         ("elpa" . "https://elpa.gnu.org/packages/")))

(package-initialize)
(unless package-archive-contents
  (package-refresh-contents))

  ;; Initialize use-package on non-Linux platforms
(unless (package-installed-p 'use-package)
  (package-install 'use-package))

(require 'use-package)
(setq use-package-always-ensure t)

;; set up auto-update of package list
(use-package auto-package-update
  :custom
  (auto-package-update-interval 7)
  (auto-package-update-prompt-before-update t)
  (auto-package-update-hide-results t)
  :config
  (auto-package-update-maybe)
  (auto-package-update-at-time "09:00"))

(provide 'rrb-package)
#+end_src

#+begin_src elisp :tangle init.el
;; require the package system
(require 'rrb-package)
#+end_src

* Window management

To easily switch between windows, use *ace-window*:

#+begin_src elisp :tangle modules/rrb-windows.el
;; easily switch windows
(use-package ace-window
    :bind (("M-q" . ace-window)))

(provide 'rrb-windows)
#+end_src

#+begin_src elisp :tangle init.el
(require 'rrb-windows)
#+end_src

* Learning Key Mappings

One of the first challenges you encounter when starting to use /Emacs/ is learning all the weird key combinations needed to make you really productive. /Emacs/ was invented well before the days of mouse-driven graphical environments, and using the keyboard was the only real way do do things. In today's world, key strokes can get things done faster than mouse clicks. Unfortunately, I never learned to type, so I use both schemes to do things.

The /Which-Key/ package can help you learn the key combinations by providing a pop-up menu of possibilities if you pause after typing a /prefix/ combination like (*C-x*, *C-c*, or *C-h*). Here is the code needed to install this package:

#+begin_src elisp :tangle modules/rrb-which.el
;; -*- lexical-binding: t -*-
;; get help with keymaps
(use-package which-key
  :init (which-key-mode)
  :diminish which-key-mode
  :config
  (setq which-key-idle-delay 0.3))

(provide 'rrb-which)
#+end_src

#+begin_src elisp :tangle init.el
;; require the which-key package
(require 'rrb-which)
#+end_src

* Spell Checking
/Emacs/ has spell checking built in, but we need to set up a spell check application and associated dictionary. We will use /Hunspell/ to do the actual checking:

#+begin_src elisp :tangle modules/rrb-spell.el
  ;; -*- lexical-binding: t -*-
  ;; Check spelling with flyspell and hunspell

  (use-package flyspell
    :custom
    (ispell-program-name "hunspell")
    (ispell-dictionary "en_US")
    (ispellpersonal-dictionary "~/.emacs.d/rrb-personal-dict")
    :config
    (ispell-set-spellchecker-params)
    :hook
    (text-mode . flyspell-mode)
    :bind
    (("C-c w s s" . ispell)
     ("C-;"       . flyspell-auto-correct-previous-word)))

  (provide 'rrb-spell)
#+end_src

#+begin_src elisp :tangle init.el
;; require the spell package
(require 'rrb-spell)
#+end_src

