docs/index.html
<div id="outline-container-orgcc70eed" class="outline-2">
<h2 id="orgcc70eed"><span class="section-number-2">5.</span> Create a Basic Theme</h2>
<div class="outline-text-2" id="text-5">
<p>
There are many themes we could use. However, here is a basic block that sets colors in an easy to tweak block of code
</p>

<div class="org-src-container">
<pre class="src src-elisp"><span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">load an example dark theme</span>
(load-theme 'wombat)
(<span style="font-weight: bold;">with-eval-after-load</span> 'wombat-theme
  (set-face-background 'default <span style="font-style: italic;">"#111"</span>)
  (set-face-background 'cursor <span style="font-style: italic;">"#c96"</span>)
  (set-face-foreground 'font-lock-comment-face <span style="font-style: italic;">"#fc0"</span>)
  (set-face-background 'isearch <span style="font-style: italic;">"#ff0"</span>)
  (set-face-foreground 'isearch <span style="font-style: italic;">"#000"</span>)
  (set-face-background 'lazy-highlight <span style="font-style: italic;">"#990"</span>)
  (set-face-foreground 'lazy-highlight <span style="font-style: italic;">"#000"</span>))
</pre>
</div>

<p>
At this point, we need to indicate that this module provides <b>rrb<sub>ui</sub></b> so theloader will not complain:
</p>


<div class="org-src-container">
<pre class="src src-elisp">(<span style="font-weight: bold;">provide</span> '<span style="font-weight: bold; text-decoration: underline;">rrb-ui</span>)
</pre>
</div>

<p>
Hook this module into the <b>init.el</b> file
</p>

<div class="org-src-container">
<pre class="src src-elisp"><span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">hook modules into this file</span>
(<span style="font-weight: bold;">require</span> '<span style="font-weight: bold; text-decoration: underline;">rrb-ui</span>)
</pre>
</div>
</div>
</div>
<div id="outline-container-org7cdb8bb" class="outline-2">
<h2 id="org7cdb8bb"><span class="section-number-2">6.</span> Package Management</h2>
<div class="outline-text-2" id="text-6">
<p>
Before we add packages to the setup, we need to set up the package management
system:
</p>

<div class="org-src-container">
<pre class="src src-elisp"><span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">-*- lexical-binding: t -*-</span>
<span style="font-weight: bold; font-style: italic;">;;</span><span style="font-weight: bold; font-style: italic;">======================================================================</span>
<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">package management</span>
<span style="font-weight: bold; font-style: italic;">;;</span>
<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Initialize package sources</span>
(<span style="font-weight: bold;">require</span> '<span style="font-weight: bold; text-decoration: underline;">package</span>)

(<span style="font-weight: bold;">setq</span> package-archives '((<span style="font-style: italic;">"melpa"</span> . <span style="font-style: italic;">"https://melpa.org/packages/"</span>)
                         (<span style="font-style: italic;">"org"</span> . <span style="font-style: italic;">"https://orgmode.org/elpa/"</span>)
                         (<span style="font-style: italic;">"elpa"</span> . <span style="font-style: italic;">"https://elpa.gnu.org/packages/"</span>)))

(package-initialize)
(<span style="font-weight: bold;">unless</span> package-archive-contents
  (package-refresh-contents))

  <span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Initialize use-package on non-Linux platforms</span>
(<span style="font-weight: bold;">unless</span> (package-installed-p 'use-package)
  (package-install 'use-package))

(<span style="font-weight: bold;">require</span> '<span style="font-weight: bold; text-decoration: underline;">use-package</span>)
(<span style="font-weight: bold;">setq</span> use-package-always-ensure t)

<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">set up auto-update of package list</span>
(<span style="font-weight: bold;">use-package</span> auto-package-update
  <span style="font-weight: bold;">:custom</span>
  (auto-package-update-interval 7)
  (auto-package-update-prompt-before-update t)
  (auto-package-update-hide-results t)
  <span style="font-weight: bold;">:config</span>
  (auto-package-update-maybe)
  (auto-package-update-at-time <span style="font-style: italic;">"09:00"</span>))

(<span style="font-weight: bold;">provide</span> '<span style="font-weight: bold; text-decoration: underline;">rrb-package</span>)
</pre>
</div>

<div class="org-src-container">
<pre class="src src-elisp"><span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">require the package system</span>
(<span style="font-weight: bold;">require</span> '<span style="font-weight: bold; text-decoration: underline;">rrb-package</span>)
</pre>
</div>
</div>
</div>
<div id="outline-container-orgcae24ba" class="outline-2">
<h2 id="orgcae24ba"><span class="section-number-2">7.</span> Window management</h2>
<div class="outline-text-2" id="text-7">
<p>
To easily switch between windows, use <b>ace-window</b>:
</p>

<div class="org-src-container">
<pre class="src src-elisp"><span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">easily switch windows</span>
(<span style="font-weight: bold;">use-package</span> ace-window
    <span style="font-weight: bold;">:bind</span> ((<span style="font-style: italic;">"M-q"</span> . ace-window)))

(<span style="font-weight: bold;">provide</span> '<span style="font-weight: bold; text-decoration: underline;">rrb-windows</span>)
</pre>
</div>

<div class="org-src-container">
<pre class="src src-elisp">(<span style="font-weight: bold;">require</span> '<span style="font-weight: bold; text-decoration: underline;">rrb-windows</span>)
</pre>
</div>
</div>
</div>
<div id="outline-container-orgd304725" class="outline-2">
<h2 id="orgd304725"><span class="section-number-2">8.</span> Learning Key Mappings</h2>
<div class="outline-text-2" id="text-8">
<p>
One of the first challenges you encounter when starting to use <i>Emacs</i> is learning all the weird key combinations needed to make you really productive. <i>Emacs</i> was invented well before the days of mouse-driven graphical environments, and using the keyboard was the only real way do do things. In today's world, key strokes can get things done faster than mouse clicks. Unfortunately, I never learned to type, so I use both schemes to do things.
</p>

<p>
The <i>Which-Key</i> package can help you learn the key combinations by providing a pop-up menu of possibilities if you pause after typing a <i>prefix</i> combination like (<b>C-x</b>, <b>C-c</b>, or <b>C-h</b>). Here is the code needed to install this package:
</p>

<div class="org-src-container">
<pre class="src src-elisp"><span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">-*- lexical-binding: t -*-</span>
<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">get help with keymaps</span>
(<span style="font-weight: bold;">use-package</span> which-key
  <span style="font-weight: bold;">:init</span> (which-key-mode)
  <span style="font-weight: bold;">:diminish</span> which-key-mode
  <span style="font-weight: bold;">:config</span>
  (<span style="font-weight: bold;">setq</span> which-key-idle-delay 0.3))

(<span style="font-weight: bold;">provide</span> '<span style="font-weight: bold; text-decoration: underline;">rrb-which</span>)
</pre>
</div>

<div class="org-src-container">
<pre class="src src-elisp"><span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">require the which-key package</span>
(<span style="font-weight: bold;">require</span> '<span style="font-weight: bold; text-decoration: underline;">rrb-which</span>)
</pre>
</div>
</div>
</div>
<div id="outline-container-orgdf1e03e" class="outline-2">
<h2 id="orgdf1e03e"><span class="section-number-2">9.</span> Spell Checking</h2>
<div class="outline-text-2" id="text-9">
<p>
<i>Emacs</i> has spell checking built in, but we need to set up a spell check application and associated dictionary. We will use <i>Hunspell</i> to do the actual checking:
</p>

<div class="org-src-container">
<pre class="src src-elisp"><span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">-*- lexical-binding: t -*-</span>
<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Check spelling with flyspell and hunspell</span>

(<span style="font-weight: bold;">use-package</span> flyspell
  <span style="font-weight: bold;">:custom</span>
  (ispell-program-name <span style="font-style: italic;">"hunspell"</span>)
  (ispell-dictionary <span style="font-style: italic;">"en_US"</span>)
  (ispellpersonal-dictionary <span style="font-style: italic;">"~/.emacs.d/rrb-personal-dict"</span>)
  <span style="font-weight: bold;">:config</span>
  (ispell-set-spellchecker-params)
  <span style="font-weight: bold;">:hook</span>
  (text-mode . flyspell-mode)
  <span style="font-weight: bold;">:bind</span>
  ((<span style="font-style: italic;">"C-c w s s"</span> . ispell)
   (<span style="font-style: italic;">"C-;"</span>       . flyspell-auto-correct-previous-word)))

(<span style="font-weight: bold;">provide</span> '<span style="font-weight: bold; text-decoration: underline;">rrb-spell</span>)
</pre>
</div>

<div class="org-src-container">
<pre class="src src-elisp"><span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">require the spell package</span>
(<span style="font-weight: bold;">require</span> '<span style="font-weight: bold; text-decoration: underline;">rrb-spell</span>)
</pre>
</div>
</div>
</div>
