emacs/dot-emacs.d/init.org
* Managing Git Projects

One of the most popular tools available in /Emacs/ is /Magit/. This tool makes
managing a git repository pretty simple. Here is the code to add it:

#+begin_src elisp :tangle modules/rrb-magit.el
(use-package magit
 :bind (("C-x g" . magit-status)
       ("C-x M-g" . magit-blame))
  :init (setq magit-auto-revert-mode nil)
  :config (add-hook 'magit-mode-hook 'hl-line-mode))

(provide 'rrb-magit)
#+end_src

#+begin_src elisp :tangle init.el
;; Git project management
(require 'rrb-magit)
#+end_src

* Configure Org Mode

/Org Mode/ is one of the reasons /Emacs/ has become so popular. This mode allows users to create powerful ways to manage their work more efficiently. You can create many types of files that teach /To Do/ lists, keep a journal, track time spent on tasks. The list of possibilities seems endless! We will start off with a simple activation of this mode, which is actually built in in modern versions of /Emacs/, but must be activated.

#+begin_src elisp :tangle modules/rrb-org.el
(require 'org)
#+end_src

This is actually sufficient to enable basic /org-mode/ functionality. However, we need to enhance this setup a bit to really make it useful. This part of the configuration is personal - you might seek other setups.

If you are using an older version of /Emacs/, you might need this block to associate files ending in *.org* with /org-mode/:

#+begin_src elisp :tangle none
;; Enable Org mode for files ending in .org
;; (add-to-list 'auto-mode-alist '("\\.org$" . org-mode))
;; (this is the default in current versions of Emacs
#+end_src

** Adding To-Do lists

Things you need to get done fall into a number of simple categories. When you decide you need to do something, you have basically defined a /task/. Over time that task will move through a number of stages. Here is the list of stages I have decided to use:

#+begin_src elisp :tangle modules/rrb-org.el
  ;; define task state list
  (setq org-todo-keywords
    '((sequence "TODO" "PLANNING" "IN-PROGRESS" "WAITING" "|" "CANCELED" "DONE")))
#+end_src

WHen a task is marked as done, we will log a timestamp to that entry

#+begin_src elisp :tangle modules/rrb-org.el
  ;; when a TODO is done record a timestamp
  (setq org-log-done 'time)
#+end_src

As you add *TODO* items (tasks) to your file, /Emacs/ can generate an /Agenda/ showing things you need to do. We need to tell the agenda system where these *.org* files are locasated:

#+begin_src elisp :tangle modules/rrb-org.el

#+end_src
#+begin_src elisp :tangle modules/rrb-org.el
  (provide 'rrb-org)
#+end_src

#+begin_src elisp :tangle modules/rrb-org.el
;; require the org package
(require 'rrb-org)
#+end_src
