docs/index.html
<div id="outline-container-org5d720d7" class="outline-2">
<h2 id="org5d720d7"><span class="section-number-2">10.</span> Managing Git Projects</h2>
<div class="outline-text-2" id="text-10">
<p>
One of the most popular tools available in <i>Emacs</i> is <i>Magit</i>. This tool makes
managing a git repository pretty simple. Here is the code to add it:
</p>

<div class="org-src-container">
<pre class="src src-elisp">(<span style="font-weight: bold;">use-package</span> magit
 <span style="font-weight: bold;">:bind</span> ((<span style="font-style: italic;">"C-x g"</span> . magit-status)
       (<span style="font-style: italic;">"C-x M-g"</span> . magit-blame))
  <span style="font-weight: bold;">:init</span> (<span style="font-weight: bold;">setq</span> magit-auto-revert-mode nil)
  <span style="font-weight: bold;">:config</span> (add-hook 'magit-mode-hook 'hl-line-mode))

(<span style="font-weight: bold;">provide</span> '<span style="font-weight: bold; text-decoration: underline;">rrb-magit</span>)
</pre>
</div>

<div class="org-src-container">
<pre class="src src-elisp"><span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Git project management</span>
(<span style="font-weight: bold;">require</span> '<span style="font-weight: bold; text-decoration: underline;">rrb-magit</span>)
</pre>
</div>
</div>
</div>
<div id="outline-container-org7d933cb" class="outline-2">
<h2 id="org7d933cb"><span class="section-number-2">11.</span> Configure Org Mode</h2>
<div class="outline-text-2" id="text-11">
<p>
<i>Org Mode</i> is one of the reasons <i>Emacs</i> has become so popular. This mode allows users to create powerful ways to manage their work more efficiently. You can create many types of files that teach <i>To Do</i> lists, keep a journal, track time spent on tasks. The list of possibilities seems endless! We will start off with a simple activation of this mode, which is actually built in in modern versions of <i>Emacs</i>, but must be activated.
</p>

<div class="org-src-container">
<pre class="src src-elisp">(<span style="font-weight: bold;">require</span> '<span style="font-weight: bold; text-decoration: underline;">org</span>)
</pre>
</div>

<p>
This is actually sufficient to enable basic <i>org-mode</i> functionality. However, we need to enhance this setup a bit to really make it useful. This part of the configuration is personal - you might seek other setups.
</p>

<p>
If you are using an older version of <i>Emacs</i>, you might need this block to associate files ending in <b>.org</b> with <i>org-mode</i>:
</p>

<div class="org-src-container">
<pre class="src src-elisp"><span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">Enable Org mode for files ending in .org</span>
<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">(add-to-list 'auto-mode-alist '("\\.org$" . org-mode))</span>
<span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">(this is the default in current versions of Emacs</span>
</pre>
</div>
</div>
<div id="outline-container-org6320296" class="outline-3">
<h3 id="org6320296"><span class="section-number-3">11.1.</span> Adding To-Do lists</h3>
<div class="outline-text-3" id="text-11-1">
<p>
Things you need to get done fall into a number of simple categories. When you decide you need to do something, you have basically defined a <i>task</i>. Over time that task will move through a number of stages. Here is the list of stages I have decided to use:
</p>

<div class="org-src-container">
<pre class="src src-elisp"><span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">define task state list</span>
(<span style="font-weight: bold;">setq</span> org-todo-keywords
  '((sequence <span style="font-style: italic;">"TODO"</span> <span style="font-style: italic;">"PLANNING"</span> <span style="font-style: italic;">"IN-PROGRESS"</span> <span style="font-style: italic;">"WAITING"</span> <span style="font-style: italic;">"|"</span> <span style="font-style: italic;">"CANCELED"</span> <span style="font-style: italic;">"DONE"</span>)))
</pre>
</div>

<p>
WHen a task is marked as done, we will log a timestamp to that entry
</p>

<div class="org-src-container">
<pre class="src src-elisp"><span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">when a TODO is done record a timestamp</span>
(<span style="font-weight: bold;">setq</span> org-log-done 'time)
</pre>
</div>

<p>
As you add <b>TODO</b> items (tasks) to your file, <i>Emacs</i> can generate an <i>Agenda</i> showing things you need to do. We need to tell the agenda system where these <b>.org</b> files are locasated:
</p>

<div class="org-src-container">
<pre class="src src-elisp">
</pre>
</div>
<div class="org-src-container">
<pre class="src src-elisp">(<span style="font-weight: bold;">provide</span> '<span style="font-weight: bold; text-decoration: underline;">rrb-org</span>)
</pre>
</div>

<div class="org-src-container">
<pre class="src src-elisp"><span style="font-weight: bold; font-style: italic;">;; </span><span style="font-weight: bold; font-style: italic;">require the org package</span>
(<span style="font-weight: bold;">require</span> '<span style="font-weight: bold; text-decoration: underline;">rrb-org</span>)
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2025-08-22</p>
<p class="author">Author: Roie R. Black</p>
<p class="date">Created: 2025-09-02 Tue 19:32</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
